# **Import Libraries**

In [105]:
import pandas as pd

# **Read & Explore Data**

In [106]:
data = pd.read_csv("Ecommerce.csv")

In [107]:
data.head()

,InvoiceNo,UnitPrice,OrderValue,Quantit,Country,InvoiceDate,InvoiceTime,Year-Month,Major Category,Minor Category,Description
0,549185,0.85,10.20,12,United Kingdom,7/4/11,09:35,2011-04,Clothes,Tops,PACK OF 20 NAPKINS PANTRY DESIGN
1,576381,2.95,35.40,12,United Kingdom,15/11/11,09:26,2011-11,Clothes,Shoes,NATURAL SLATE HEART CHALKBOARD
2,551192,1.25,20.00,16,United Kingdom,27/4/11,10:54,2011-04,Kitchen,Cutlery,36 PENCILS TUBE SKULLS
3,573553,7.46,7.46,1,United Kingdom,31/10/11,13:48,2011-10,Garden,Turf,SET 6 SCHOOL MILK BOTTLES IN CRATE
4,539436,2.51,2.51,1,United Kingdom,17/12/10,14:49,2010-12,Garden,Hoses,FINE WICKER HEART

In [108]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   InvoiceNo       700 non-null    int64
 1   UnitPrice       700 non-null    float64
 2   OrderValue      700 non-null    float64
 3   Quantit         700 non-null    int64
 4   Country         700 non-null    object
 5    InvoiceDate    700 non-null    object
 6   InvoiceTime     700 non-null    object
 7   Year-Month      700 non-null    object
 8   Major Category  700 non-null    object
 9   Minor Category  700 non-null    object
 10  Description     700 non-null    object
dtypes: float64(2), int64(2), object(7)
memory usage: 60.3+ KB

In [109]:
data.describe()

         InvoiceNo     UnitPrice  OrderValue      Quantit
count     700.000000  700.000000  700.000000   700.000000
mean   559180.801429    3.367086   31.978471    20.865714
std     13246.185339    8.280695   63.658083    63.867322
min    536370.000000    0.120000    0.290000     1.000000
25%    547501.000000    1.250000    8.290000     3.000000
50%    559327.500000    1.950000   15.600000     8.000000
75%    570672.000000    3.750000   25.272500    16.000000
max    581587.000000  202.420000  633.600000  1152.000000

In [110]:
data.describe(include='O')

,Country,InvoiceDate,InvoiceTime,Year-Month,Major Category,Minor Category,Description
count,700,700,700,700,700,700,700
unique,5,240,341,13,4,17,398
top,United Kingdom,13/5/11,14:09,2011-11,Garden,Tops,POSTAGE
freq,300,17,20,106,189,63,11

## Check Nulls & Dublicates

In [111]:
# Checking for missing values
data.isnull().sum()

InvoiceNo         0
UnitPrice         0
OrderValue        0
Quantit           0
Country           0
 InvoiceDate      0
InvoiceTime       0
Year-Month        0
Major Category    0
Minor Category    0
Description       0
dtype: int64

In [112]:
# Checking for duplicates
data.duplicated().sum()

0

# **Data Cleaning**

In [113]:
# Taking copy from original data
df = data.copy()

## Rename Columns

In [114]:
# Viewing columns
print(df.columns)

Index(['InvoiceNo  ', 'UnitPrice', 'OrderValue', 'Quantit', 'Country',
       ' InvoiceDate', 'InvoiceTime', 'Year-Month', 'Major Category',
       'Minor Category', 'Description'],
      dtype='object')

In [115]:
# Renaming (snake_case)
df.columns = ['invoice_no', 'unit_price', 'order_value', 'quantity', 'country', 'invoice_date', 'invoice_time', 'year_month', 'major_category', 'minor_category', 'description']
print(df.columns)

Index(['invoice_no', 'unit_price', 'order_value', 'quantity', 'country',
       'invoice_date', 'invoice_time', 'year_month', 'major_category',
       'minor_category', 'description'],
      dtype='object')

## Drop Unnecessary Columns

In [116]:
df.drop(['invoice_no', 'year_month'], axis=1, inplace=True)
df.head()

,unit_price,order_value,quantity,country,invoice_date,invoice_time,major_category,minor_category,description
0,0.85,10.20,12,United Kingdom,7/4/11,09:35,Clothes,Tops,PACK OF 20 NAPKINS PANTRY DESIGN
1,2.95,35.40,12,United Kingdom,15/11/11,09:26,Clothes,Shoes,NATURAL SLATE HEART CHALKBOARD
2,1.25,20.00,16,United Kingdom,27/4/11,10:54,Kitchen,Cutlery,36 PENCILS TUBE SKULLS
3,7.46,7.46,1,United Kingdom,31/10/11,13:48,Garden,Turf,SET 6 SCHOOL MILK BOTTLES IN CRATE
4,2.51,2.51,1,United Kingdom,17/12/10,14:49,Garden,Hoses,FINE WICKER HEART

## Remove Leading and Trailing Spaces

In [117]:
df['major_category'][0]

'    Clothes  '

In [118]:
# Removing spaces
df = df.apply(lambda x: x.str.strip() if x.dtype == 'object' else x)

In [119]:
df['major_category'][0]

'Clothes'

## **Change Data Types**

### 'invoice_date' to datetime

In [120]:
df.invoice_date

0        7/4/11
1      15/11/11
2       27/4/11
3      31/10/11
4      17/12/10
         ...
695     23/8/11
696     13/5/11
697     23/8/11
698     13/5/11
699     23/8/11
Name: invoice_date, Length: 700, dtype: object

In [121]:
# Converting to datatime
df.invoice_date = pd.to_datetime(df.invoice_date)
df.invoice_date

C:\Users\fg\AppData\Local\Temp\ipykernel_13484\3021235846.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df.invoice_date = pd.to_datetime(df.invoice_date)

0     2011-07-04
1     2011-11-15
2     2011-04-27
3     2011-10-31
4     2010-12-17
         ...
695   2011-08-23
696   2011-05-13
697   2011-08-23
698   2011-05-13
699   2011-08-23
Name: invoice_date, Length: 700, dtype: datetime64[ns]

### 'invoice_time' to timedelta

In [122]:
df.invoice_time

0      09:35
1      09:26
2      10:54
3      13:48
4      14:49
       ...
695    09:38
696    14:09
697    09:38
698    14:09
699    09:38
Name: invoice_time, Length: 700, dtype: object

In [123]:
# Converting to timedelta
df.invoice_time = df.invoice_time.apply(lambda x: x + ':00')
df.invoice_time

0      09:35:00
1      09:26:00
2      10:54:00
3      13:48:00
4      14:49:00
         ...
695    09:38:00
696    14:09:00
697    09:38:00
698    14:09:00
699    09:38:00
Name: invoice_time, Length: 700, dtype: object

In [124]:
df.invoice_time = pd.to_timedelta(df.invoice_time)
df.invoice_time

0     0 days 09:35:00
1     0 days 09:26:00
2     0 days 10:54:00
3     0 days 13:48:00
4     0 days 14:49:00
            ...
695   0 days 09:38:00
696   0 days 14:09:00
697   0 days 09:38:00
698   0 days 14:09:00
699   0 days 09:38:00
Name: invoice_time, Length: 700, dtype: timedelta64[ns]

## **Handling Outliers**

### 'unit_price'

In [125]:
# Checking 'unit_price' outliers
df.unit_price.describe()

count    700.000000
mean       3.367086
std        8.280695
min        0.120000
25%        1.250000
50%        1.950000
75%        3.750000
max      202.420000
Name: unit_price, dtype: float64

In [126]:
# Quantiles
df.unit_price.quantile([0.8, 0.9, 0.93, 0.95, 0.98, 0.99, 1])

0.80      4.250
0.90      7.118
0.93      8.250
0.95      9.992
0.98     18.000
0.99     18.000
1.00    202.420
Name: unit_price, dtype: float64

In [127]:
# Counting outliers
df[df.unit_price > 10].count()

unit_price        35
order_value       35
quantity          35
country           35
invoice_date      35
invoice_time      35
major_category    35
minor_category    35
description       35
dtype: int64

In [128]:
## Removing outliers
df = df[df.unit_price <= 10]

In [129]:
df.unit_price.describe()

count    665.000000
mean       2.470165
std        2.014000
min        0.120000
25%        1.000000
50%        1.660000
75%        3.290000
max        9.950000
Name: unit_price, dtype: float64

### 'order_values'

In [130]:
# Checking 'order_value' outliers
df.order_value.describe()

count    665.000000
mean      30.486947
std       62.356695
min        0.290000
25%        7.800000
50%       15.000000
75%       24.960000
max      633.600000
Name: order_value, dtype: float64

In [131]:
## Quantiles
df.order_value.quantile([0.8, 0.9, 0.93, 0.94, 0.95, 0.98, 0.99, 1])

0.80     30.0000
0.90     59.4000
0.93     75.3120
0.94     86.4720
0.95    121.9200
0.98    233.2320
0.99    393.3696
1.00    633.6000
Name: order_value, dtype: float64

In [132]:
## Counting outliers
df[df.order_value > 85].count()

unit_price        41
order_value       41
quantity          41
country           41
invoice_date      41
invoice_time      41
major_category    41
minor_category    41
description       41
dtype: int64

In [133]:
## Removing outliers
df = df[df.order_value <= 85]

In [134]:
df.order_value.describe()

count    624.000000
mean      17.712853
std       15.704815
min        0.290000
25%        7.492500
50%       15.000000
75%       20.462500
max       81.600000
Name: order_value, dtype: float64

### 'quantity'

In [135]:
# Checking 'quantity' outliers
df.quantity.describe()

count    624.000000
mean      12.562500
std       22.452074
min        1.000000
25%        3.000000
50%        8.000000
75%       12.000000
max      360.000000
Name: quantity, dtype: float64

In [136]:
# Quantiles
df.quantity.quantile([0.8, 0.9, 0.93, 0.94, 0.95, 0.98, 0.99, 1])

0.80     18.0
0.90     24.0
0.93     25.0
0.94     25.0
0.95     32.0
0.98     60.0
0.99     96.0
1.00    360.0
Name: quantity, dtype: float64

In [137]:
# Counting outliers
df[df.quantity > 32].count()

unit_price        30
order_value       30
quantity          30
country           30
invoice_date      30
invoice_time      30
major_category    30
minor_category    30
description       30
dtype: int64

In [138]:
# Removing outliers
df = df[df.quantity <= 32]

In [139]:
df.quantity.describe()

count    594.000000
mean       9.106061
std        7.579852
min        1.000000
25%        3.000000
50%        8.000000
75%       12.000000
max       32.000000
Name: quantity, dtype: float64

# **Feature Engineering**

In [140]:
df.head()

,unit_price,order_value,quantity,country,invoice_date,invoice_time,major_category,minor_category,description
0,0.85,10.20,12,United Kingdom,2011-07-04,0 days 09:35:00,Clothes,Tops,PACK OF 20 NAPKINS PANTRY DESIGN
1,2.95,35.40,12,United Kingdom,2011-11-15,0 days 09:26:00,Clothes,Shoes,NATURAL SLATE HEART CHALKBOARD
2,1.25,20.00,16,United Kingdom,2011-04-27,0 days 10:54:00,Kitchen,Cutlery,36 PENCILS TUBE SKULLS
3,7.46,7.46,1,United Kingdom,2011-10-31,0 days 13:48:00,Garden,Turf,SET 6 SCHOOL MILK BOTTLES IN CRATE
4,2.51,2.51,1,United Kingdom,2010-12-17,0 days 14:49:00,Garden,Hoses,FINE WICKER HEART

## Date

In [141]:
# Creating 'year' column
df['year'] = df.invoice_date.dt.year
df.year

0      2011
1      2011
2      2011
3      2011
4      2010
       ...
695    2011
696    2011
697    2011
698    2011
699    2011
Name: year, Length: 594, dtype: int32

In [142]:
# Creating 'month' column
df['month'] = df.invoice_date.dt.month
df.month

0       7
1      11
2       4
3      10
4      12
       ..
695     8
696     5
697     8
698     5
699     8
Name: month, Length: 594, dtype: int32

In [143]:
# # Creating 'quarter' column
# def quarter(month):
#     if month in [1, 2, 3]:
#         return 'Q1'
#     elif month in [4, 5, 6]:
#         return 'Q2'
#     elif month in [7, 8, 9]:
#         return 'Q3'
#     else:
#         return 'Q4'

In [144]:
# df['quarter'] = df.month.apply(quarter)
# df.quarter

In [145]:
# Creating 'quarter' column with lambda
df['quarter'] = df.month.apply(lambda x: 'Q1' if x in [1, 2, 3] else 'Q2' if x in [4, 5, 6] else 'Q3' if x in [7, 8, 9] else 'Q4')
df.quarter

0      Q3
1      Q4
2      Q2
3      Q4
4      Q4
       ..
695    Q3
696    Q2
697    Q3
698    Q2
699    Q3
Name: quarter, Length: 594, dtype: object

## Time

In [146]:
# Creating 'hour' column
df['hour'] = df.invoice_time.dt.components['hours']
df.hour

0       9
1       9
2      10
3      13
4      14
       ..
695     9
696    14
697     9
698    14
699     9
Name: hour, Length: 594, dtype: int64

In [147]:
# # Creating 'day_time' column
# def day_time(hour):
#     if hour in list(range(0, 13)): # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]
#         return 'Morning'
#     elif hour in list(range(13, 19)): # [13, 14, 15, 16, 17, 18]
#         return 'Afternoon'
#     else:
#         return 'Evening'

In [148]:
# df['day_time'] = df.hour.apply(day_time)
# df['day_time']

In [149]:
df['day_time'] = df.hour.apply(lambda x: 'Morning' if x in list(range(0, 13)) else 'Afternoon' if x in list(range(13, 19)) else 'Evening')
df['day_time']

0        Morning
1        Morning
2        Morning
3      Afternoon
4      Afternoon
         ...
695      Morning
696    Afternoon
697      Morning
698    Afternoon
699      Morning
Name: day_time, Length: 594, dtype: object

## Droping Columns After Feature Engineer

In [150]:
df.drop(['invoice_date', 'invoice_time'], axis=1, inplace=True)

# **Conclusion**

## Data Before Cleaning

In [151]:
data.head()

,InvoiceNo,UnitPrice,OrderValue,Quantit,Country,InvoiceDate,InvoiceTime,Year-Month,Major Category,Minor Category,Description
0,549185,0.85,10.20,12,United Kingdom,7/4/11,09:35,2011-04,Clothes,Tops,PACK OF 20 NAPKINS PANTRY DESIGN
1,576381,2.95,35.40,12,United Kingdom,15/11/11,09:26,2011-11,Clothes,Shoes,NATURAL SLATE HEART CHALKBOARD
2,551192,1.25,20.00,16,United Kingdom,27/4/11,10:54,2011-04,Kitchen,Cutlery,36 PENCILS TUBE SKULLS
3,573553,7.46,7.46,1,United Kingdom,31/10/11,13:48,2011-10,Garden,Turf,SET 6 SCHOOL MILK BOTTLES IN CRATE
4,539436,2.51,2.51,1,United Kingdom,17/12/10,14:49,2010-12,Garden,Hoses,FINE WICKER HEART

In [152]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   InvoiceNo       700 non-null    int64
 1   UnitPrice       700 non-null    float64
 2   OrderValue      700 non-null    float64
 3   Quantit         700 non-null    int64
 4   Country         700 non-null    object
 5    InvoiceDate    700 non-null    object
 6   InvoiceTime     700 non-null    object
 7   Year-Month      700 non-null    object
 8   Major Category  700 non-null    object
 9   Minor Category  700 non-null    object
 10  Description     700 non-null    object
dtypes: float64(2), int64(2), object(7)
memory usage: 60.3+ KB

## Data After Cleanging

In [153]:
df.head()

,unit_price,order_value,quantity,country,major_category,minor_category,description,year,month,quarter,hour,day_time
0,0.85,10.20,12,United Kingdom,Clothes,Tops,PACK OF 20 NAPKINS PANTRY DESIGN,2011,7,Q3,9,Morning
1,2.95,35.40,12,United Kingdom,Clothes,Shoes,NATURAL SLATE HEART CHALKBOARD,2011,11,Q4,9,Morning
2,1.25,20.00,16,United Kingdom,Kitchen,Cutlery,36 PENCILS TUBE SKULLS,2011,4,Q2,10,Morning
3,7.46,7.46,1,United Kingdom,Garden,Turf,SET 6 SCHOOL MILK BOTTLES IN CRATE,2011,10,Q4,13,Afternoon
4,2.51,2.51,1,United Kingdom,Garden,Hoses,FINE WICKER HEART,2010,12,Q4,14,Afternoon

In [154]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 594 entries, 0 to 699
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   unit_price      594 non-null    float64
 1   order_value     594 non-null    float64
 2   quantity        594 non-null    int64
 3   country         594 non-null    object
 4   major_category  594 non-null    object
 5   minor_category  594 non-null    object
 6   description     594 non-null    object
 7   year            594 non-null    int32
 8   month           594 non-null    int32
 9   quarter         594 non-null    object
 10  hour            594 non-null    int64
 11  day_time        594 non-null    object
dtypes: float64(2), int32(2), int64(2), object(6)
memory usage: 55.7+ KB

## Removed Percentage

In [155]:
print(f'Removed Data: {round((((data.shape[0] - df.shape[0]) / data.shape[0]) * 100), 2)}%')

Removed Data: 15.14%

## Save New Data

In [156]:
df.to_csv('Ecommerce Cleaned.csv', index=False)

# **Thanks**